app/controllers/home_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def viewprofile
    @user = User.find_by id:params[:id]

UPDATE "student_infos" SET "avatar_file_name" = ?, "avatar_updated_at" = ?, "emailcanhan" = ?, "skypeid" = ?, "facebook" = ?, "vitricanbo" = ?, "ngoaingu" = ?, "chungchi" = ?, "kinhnghiem" = ?, "ghichu" = ?, "updated_at" = ? WHERE "student_infos"."id" = ?
INSERT INTO "student_infos" ("emailcanhan", "skypeid", "facebook", "dienthoai", "vitricanbo", "ngoaingu", "chungchi", "kinhnghiem", "mongmuon", "ghichu", "user_id", "created_at", "updated_at", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "lecturer_infos" ("user_id", "gmail", "ghichu", "created_at", "updated_at", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def update
    if current_user.has_role? :student
      if current_user.student_info
        @info = current_user.student_info
        @info.update(student_info_params)
      else
        @info = StudentInfo.new(student_info_params)
        @info.user_id = current_user.id
        @info.save

      end
    elsif current_user.has_role? :partner
      if current_user.partner_info
        @info = current_user.partner_info
        @info.update(partner_info_params)
      else
        @info = PartnerInfo.new(partner_info_params)
        @info.user_id = current_user.id
        @info.save
      end
    elsif current_user.has_role? :lecturer
      if current_user.lecturer_info
        @info = current_user.lecturer_info
        @info.update(lecturer_info_params)
      else
        @info = LecturerInfo.new(lecturer_info_params)
        @info.user_id = current_user.id
        @info.save