app/controllers/thuctaps_controller.rb

SELECT  "thuctaps".* FROM "thuctaps" ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "thuctaps"
---
  def index
    @page = params[:page]
    @thuctaps = Thuctap.all.order("created_at DESC").page @page

INSERT INTO "thuctaps" ("partner_info_id", "title", "content", "address", "tag", "endtime", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @thuctap = Thuctap.new(thuctap_params)
    respond_to do |format|
      if @thuctap.save

UPDATE "thuctaps" SET "title" = ?, "content" = ?, "address" = ?, "tag" = ?, "endtime" = ?, "updated_at" = ? WHERE "thuctaps"."id" = ?  [["title", "asfd"], ["content", "asdf"], ["address", "asdfaasdf"], ["tag", "sadf"], ["endtime", "2018-06-10 09:35:00"], ["updated_at", "2018-06-10 09:35:20.434666"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @thuctap.update(thuctap_params)

DELETE FROM "thuctaps" WHERE "thuctaps"."id" = ?  [["id", 1]]
---
  def destroy
    @thuctap.destroy

SELECT  "thuctaps".* FROM "thuctaps" WHERE "thuctaps"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_thuctap
      @thuctap = Thuctap.find(params[:id])