app/controllers/thuctaps_controller.rb

SELECT "thuctaps".* FROM "thuctaps"
---
  def index
    @thuctaps = Thuctap.all