app/controllers/partner/thuctap_controller.rb

    def index
        if @user && @user.partner_info && (@user.has_role? :partner)
            @page = params[:page]


            @thuctaps = @user.partner_info.thuctaps.order("created_at DESC").page @page
---
SELECT  "thuctaps".* FROM "thuctaps" WHERE "thuctaps"."partner_info_id" = ? ORDER BY created_at DESC LIMIT ? OFFSET ?  [["partner_info_id", 1], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "thuctaps" WHERE "thuctaps"."partner_info_id" = ?  [["partner_info_id", 1]]

    def find_id
        @user = User.find_by id:params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]